//Напишите программу, которая принимает от пользователя строку,
//содержащую числа, разделенные запятой. Используя метод Split(),
//разделите строку на отдельные числа и найдите их сумму. Выведите
//полученную сумму на экран.
//Пример:
//Введите строку чисел: 10, 20, 30, 40, 50
//Сумма чисел: 150


//Console.Write("Введите числа разделенные запятой: ");
//string text = Console.ReadLine();
//int sum = 0;
//string[] mas = text.Split(',');
//for (int i  = 0; i  < mas.Length; i ++)
//{
//    Console.WriteLine(mas[i]);
//}
//foreach (string s in mas)
//{
//    sum += int.Parse(s);
//}
//Console.Write(sum);


//Напишите программу, которая запрашивает у пользователя
//предложение и определяет, сколько слов в нем содержатся. Для этого
//используйте метод Split() для разделения предложения на отдельные
//слова и подсчитайте их количество. Выведите полученное число на
//экран

//Console.WriteLine("Введите текст: ");
//string text = Console.ReadLine();
//int count = 0;
//string[] mas = text.Split(' ');
//for (int i = 0; i < mas.Length; i++)
//{
//    Console.WriteLine(mas[i]);
//}
//foreach (string s in mas)
//{
//    count++;
//}
//Console.WriteLine(count);



